package kensyu01;
/**************************************************
	インポート
**************************************************/
// 共用定数を読み込む
import static kensyu01.commonConstants.*;

/**************************************************
	クラス
**************************************************/
/*
 * 定期預金機能を拡張した銀行口座クラス
 */
public class TimeBankAccount extends BankAccount {


	/**************************************************
		インスタンス変数
	**************************************************/
	private long mTimeBalance;		// 定期預金フィールドを設定する
	
	
	/**************************************************
		コンストラクタ
	**************************************************/
	public TimeBankAccount(String name, String accountNumber, long balance, long timeBalance){
		// 親クラスのコンストラクタから 名前、口座番号、残高を設定する
		super(name, accountNumber, balance);
		// 定期預金残高を設定する
		this.mTimeBalance = timeBalance;
	}

	/**************************************************
		ゲッター
	**************************************************/
	// 定期預金残高を取得するゲッターを設定する
	public long mGetTimeBalance(){
		// 定期預金残高を返す
		return this.mTimeBalance;
	}

	/**************************************************
		インスタンスメソッド
	**************************************************/
	// 定期預金を解約して全額を普通預金に移すメソッドを設定する
	public void mCancel(){
		// 定期預金分の金額を普通預金に加算する
		mDeposit(this.mTimeBalance);
		// 定期預金を 0 にする
		this.mTimeBalance = INITIALIZE_ZERO;
	}
}
