package shape;

/*************************************************
	抽象クラス
*************************************************/
/*
 *  図形クラス(抽象)
 */
public abstract class AbstractShape {
	
	/*************************************************
		抽象メソッド
	*************************************************/
	/*
	 * 派生クラスで図形描画メソッドとして定義する
	 */
	public abstract void mDraw();

	/*************************************************
		抽象メソッド(オーバーライド)
	*************************************************/
	/*
	 * 派生クラスで図形情報を出力するメソッドとして定義する
	 * @see java.lang.Object#toString()
	 */
	@Override public abstract String toString();

	/*************************************************
		メソッド(他メソッド依存)
	*************************************************/
	/*
	 * 派生クラスで実装した図形情報を出力し、図形を描画するメソッドを定義する
	 */
	public void print(){
		// 図形情報を出力する
		System.out.println(toString());
		// 図形を表示する
		mDraw();
	}
}
