package shape;

import static shape.CommonShapeConstants.*;

/*************************************************
	クラス
*************************************************/
// 点を描画するクラス
public class Point extends AbstractShape{
	/*************************************************
		定数(文字列)
	*************************************************/
	// 描画する図形を示す文字列を設定する
	public static final String TEXT_SHAPE_POINT = "Point";
	
	/*************************************************
		コンストラクタ
	*************************************************/
	/*
	 * Objectクラスのコンストラクタを呼び出さないために
	 * 何もしないコンストラクタを定義する
	 */
	public Point(){};
	
	
	/*************************************************
		オーバーライド
	*************************************************/
	/*
	 * 描画する図形を示す文字列を返すメソッドを実装する
	 * @see e13_1_shape.AbstractShape#toString()
	 */
	@Override public String toString(){
		// 描画する図形を示す文字列を返す
		return TEXT_SHAPE_POINT;
	}
	
	/*************************************************
		メソッド
	*************************************************/
	/*
	 * 点を描画するメソッドを設定する
	 * @see e13_1_shape.AbstractShape#mDraw()
	 */
	public void mDraw(){
		// 点を描画する
		System.out.println(DRAW_POINT);
	};
}
